export default {
  100: 'Неверные входные данные. Ошибка при проверке входных данных',

  // Field validation errors
  110: 'Поле не должно быть пустым',
  111: 'Поле должно быть числовым',
  112: 'Поле должно быть действительным регулярным выражением',
  113: 'Поле должно быть адресом электронной почты',
  114: 'Один из нескольких полей должно быть не пустым',
  115: 'Поле не может быть равно такому значению',
  116: 'Значение поля должно быть между...',
  117: 'Поле должно быть равно значение...',
  118: 'Поле должно содержать допустимый формат даты и времени',
  119: 'Поле является слишком коротким',

  // File validation errors /
  130: 'Ошибка при проверке файла',
  131: 'Превышен максимальный размер файла',
  132: 'Файл не разрешенных типов',
  133: 'Изображение слишком маленького разрешения',
  134: 'Изображение слишком большого разрешения',
  135: 'Ресурс для файла не найдены',
  136: 'Поле не найдено в ресурсе',
  137: 'Слот файла не найден в базе',

  150: 'Связанный объект не найден',
  151: 'Объект уже существует',

  170: 'Ошибка при сохранение изображения',
  180: 'Объект уже обработан',

  // Period validation errors /
  200: 'Операция ограничена, потому что период не прошел',
  201: 'Пользователь может выполнить операцию только один раз',

  // Custom error codes /
  300: 'Пароли не совпадают',
  301: 'Неверное имя пользователя или пароль'
};